package com.itheima.a08regexdemo;

import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class RegexDemo7 {
    public static void main(String[] args) {
        // -------------------------------- 正则表达式 : 爬虫 --------------------------------

        /*
            需求:把下面文本中的座机电话，邮箱，手机号，热线都爬取出来。
            来黑马程序员学习Java，
            手机号:18512516758，18512508907或者联系邮箱:boniu@itcast.cn，
            座机电话:01036517895，010-98951256邮箱:bozai@itcast.cn，
            热线电话:400-618-9090 ，400-618-4000，4006184000，4006189090

            手机号的正则表达式:1[3-9]\d{9}
            邮箱的正则表达式:\w+@[\w&&[^_]]{2,6}(\.[a-zA-Z]{2,3}){1,2}座机电话的正则表达式:θ\d{2,3}-?[1-9]\d{4,9}
            热线电话的正则表达式:400-?[1-9]\\d{2}-?[1-9]\\d{3}

        */

        String str = "来黑马程序员学习Java，手机号:18512516758，18512508907或者联系邮箱:boniu@itcast.cn，" +
                "座机电话:01036517895，010-98951256邮箱:bozai@itcast.cn，热线电话:400-618-9090 ，" +
                "400-618-4000，4006184000，4006189090";

        //编写正则表达式
        //座机电话 : \w+@[\w&&[^_]]{2,6}(\.[a-zA-Z]{2,3}){1,2}
        //手机号码 : 1[3-9]\\d{9}
        //热线电话 : 400-?[1-9]\\d{2}-?[1-9]\\d{3}
        //邮箱 : \w+@[\w&&[^_]]{2,6}(\.[a-zA-Z]{2,3}){1,2}

        //编写正则表达式规则对象 --
        Pattern p = Pattern.compile("1[3-9]\\d{9}|\\w+@\\w{2,6}\\.[a-zA-Z]{2,3}" +
                "(\\.[a-zA-Z]{2,3})?|400-?[1-9]\\d{2}-?[1-9]\\d{3}");

        //获取匹配器 -- 用m去读取文本str , 根据规则p 去文本str里面寻找匹配的内容
        Matcher m = p.matcher(str);

        //循环匹配  ---  循环条件为匹配成功 ( 调用 find()方法 -- 匹配成功返回true, 匹配失败返回false )
        while(m.find()){
            //m.group()方法 : 根据find()方法返回的索引，截取子串
            System.out.println(m.group());
        }
    }
}
